
require "./DataSrv/Script/sysDef"

function WorldGuide_0()
{
    self->sayNext("這個城鎮就是#m104000000#！好的，我將會為你介紹#b#m104000000##k。這是初心者們從楓之港離開後第一個抵達的城鎮，也就是所有勇士的冒險起點。");
    self->sayNext("這是一個非常安寧且環繞著海洋的城鎮，因為這裡位於島嶼的西部，因此很多冒險家時常會光顧這裡，他們看似可怕，但其實您大可直接試著與他們談話，他們會對你非常友善的。");
    self->sayNext("這附近的怪物都非常的弱小，非常適合初心者。在你選擇職業之前，這裡是一個非常好的練等地點。");
}

function WorldGuide_1()
{
    self->sayNext("好的，我將為您介紹#b#m102000000##k。那是一個位於維多利亞島最北邊的勇士部落，同時四周被岩石山所包圍著。那邊的環境氣候非常嚴峻，只有強大的冒險家可以生存於那。");
    self->sayNext("在那裡的高處充滿著大量危險的怪物，同時也有一個非常隱密的村落，當你進入那，你會發現有很多地牢並且有巨大的龍包圍著那裡。前往之前務必小心謹慎，或者別去了！");
    self->sayNext("如果你想成為#劍士#k那麼你可以在那邊找到#r長老#k，當你等級高於10等，且擁有足夠的力量，你就擁有資格成為他們的一員。如果沒有，請再多加鍛鍊自己吧！");
}

function WorldGuide_2()
{
    self->sayNext("好的，我將為您介紹#b#m101000000##k，那是一個充滿魔法的城鎮，位於維多利亞島的最西邊，並且被很多高聳神秘的神樹包圍著。在那邊居住著少數的精靈，他們非常討厭人類，所以你最好保持安靜或者不要惹火他們。");
    self->sayNext("在那附近你可以找到綠水靈以及菇菇還有猴子等等，甚至是殭屍怪物。在深處，居住著很多能夠飛行的巫婆。真誠的建議：除非你真的夠強大，否則我不建議你到那邊去探索。");
    self->sayNext("如果你想成為#b法師#k，那麼去#r圖書館#k找到那裡的負責人，據說是那邊最強大的魔法師。如果你等級高於8等，且有足夠的智力的話，他會讓你成為法師的。如果你還沒有達到，那麼請再多加訓練自己吧。");
}

function WorldGuide_3()
{
    self->sayNext("好的，我將為您介紹#b#m100000000##k。那是一個居住著弓箭手的村落，位於島嶼的最南方，四處充滿著平原，且氣候也非常宜人，是個非常適合長久居住的村落，有空的話應該去看看！");
    self->sayNext("在平原附近有很多低等的怪物如嫩寶、菇菇仔以及肥肥。據我所知，在城鎮的某處可以通往肥肥公園深處居住著一隻非常強大的怪物叫做菇菇王。");
    self->sayNext("如果你想成#b弓箭手村#k，那麼你該去找位於弓箭手村的#r公主#k。當你的等級達到了10等以上且有足夠的敏捷，那麼你就有機會可以成為弓箭手，如果條件不符，那你必須再多加鍛鍊自己！");
}

function WorldGuide_4()
{
    self->sayNext("好的，我將為您介紹#b#m103000000##k。那是一個居住著很多盜賊的城鎮，位於維多利亞的西北方，那邊的建築風格總是給人一種陌生奇怪的感覺。在那邊幾乎隨時都被烏雲給壟罩著，但在高處你仍然有機會可以看到美麗的夕陽。");
    self->sayNext("你可以前往數種冒險之地：擁有鱷魚以及青蛇的沼澤地或者充滿幽靈以及蝙蝠的地鐵。據說在地底深處，居住著非常龐大可怕的怪物。");
    self->sayNext("如果你想成為#b盜賊#k，那你應該去那邊找到#r達克魯#k，是那個城鎮的核心人物。當你的等級達到了10等以上，且有足夠的敏捷與幸運的話，他可能會讓你成為盜賊。如果還沒達到條件的話，你必須在更加努力訓練自己！");
}

function WorldGuide_5()
{
    self->sayNext("目前關於#b#m120000000##k的情報非常少，那其實是一個停靠在魔法森林與弓箭手村之間的潛水艇。那是海盜們的棲息地點。你可以在那邊欣賞到非常漂亮的海景，就跟在維多利亞港一樣。");
    self->sayNext("#m120000000#停靠在弓箭手村與魔法森林之間，所以在當地可以同時欣賞到兩種不同感覺的風景。在那邊的海盜也對外人非常友好，這點你大可放心。");
    self->sayNext("如果你認真的想成為#b海盜#k，最好去找#m120000000#的船長#r#p1090000##k。如果你的等級達到了10等以上，且有足夠的敏捷，他可能會幫你一把！如果還沒達到條件的話，你必須在更加努力訓練自己！");
}

function WorldGuide_6()
{
    self->sayNext("好的，我將為您介紹#b#m105040300##k。那裡坐落於維多利亞島的南方，很接近弓箭手村與螞蟻洞窟，同時那邊有一家旅館供冒險者休息，大致上來說還算是一個非常安寧的城鎮。");
    self->sayNext("在旅館附近有一位神秘的#r僧侶#k。沒有人知道他真正的身分以及意圖，聽說他在收集冒險者帶去的材料並且替他們製作東西。這方面的訊息不是很充足，如果你有機會到那裡的話，請務必幫我多加確認。");
    self->sayNext("在那附近你可以找到一個通往維多利亞島最深處的地道，在那邊居住著大量可怕強大的怪物，所以當你要到那邊探險時，請務必做好全面的準備並且最好的話請找幾位隊友一同前往！");
    self->sayNext("這就是我所知道的了...那邊如其名就是個非常神祕的地方。聽說在深處有很多神秘且會移動的黑色岩石，我真想親自前往一探究竟...");
}

function WorldGuide()
{
    option = self->askMenu("維多利亞島有7個大城鎮，你想要深入瞭解哪一個地方？\r\n#b#L0##m104000000##l\r\n#L1##m102000000##l\r\n#L2##m101000000##l\r\n#L3##m100000000##l\r\n#L4##m103000000##l\r\n#L5##m120000000##l\r\n#L6##m105040300##l");
    
    --Dynamic function naming
    _G["WorldGuide_" .. option]();
}

self->sayNext("想要到其他城鎮嗎？只需要一點費用我就可以帶你到其他地方。#r初心者享有一折優惠。");
option = self->askMenu("不用擔心，可能你是第一次來到這個地方。\r\n#L0#介紹維多利亞島#k#l\r\n#L1#告訴我有什麼地方可以去#k#l");
if(option == 0)
    WorldGuide();
else
{
    --Preparing costs and field lists
    isBeginner = target->getJob() == 0;
    fieldTable = { 102000000, 101000000, 100000000, 103000000, 120000000 };
    transferCost = { 1200, 1200, 800, 1000, 1000 };
    optionStr = "以下是我可以帶你去的地方：";
    if(isBeginner) 
    {
        --Seting discounts for beginners
        for k, v in pairs(transferCost)
            transferCost[k] = math.ceil(v * 0.1);
        optionStr = optionStr .. "\r\n#r(由於您是初心者，因此價錢只需要原本的一折！)#k\r\n"
    }

    --Making options, remeber to use .. to perform string concatenation rather than +
    for k, v in pairs(fieldTable)
        optionStr = optionStr .. "\r\n#L" .. k .. "##m" .. v .. "# (" .. transferCost[k] .. "楓幣)#l";

    --Asking and transfering.
    option = self->askMenu(optionStr);
    if(self->askYesNo("你確定想要前往#b#m" .. fieldTable[option] .. "##k嗎？總共需要#b" .. transferCost[option] .. "楓幣#k。") == 1)
        if(inventory->exchange(-transferCost[option]) == 1)
            self->say("對不起，您似乎沒有足夠的楓幣。");
        else
            target->transferField(fieldTable[option], "");
}
